nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
/**
 * @file lcl_hadm_measurement.c
 *
 * This file implements platform dependent HADM functionality
 *
 */
/*
 * Copyright 2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/* === Includes ============================================================ */
#include <stdint.h>
#include <stdbool.h>
#include "fsl_os_abstraction.h"
#include "fsl_ltc.h" /* LTC driver for AES */
#include "EmbeddedTypes.h"
#include "nxp_xcvr_lcl_ctrl.h"
#include "nxp_xcvr_lcl_step_mgr.h"
#include "nxp_xcvr_trim.h"
#include "lcl_hadm_measurement.h"
#include "lcl_xcvr_hal.h"
#include "lcl_hadm_utils.h"
#include "lcl_hadm_hartt.h"
#include "nxp2p4_xcvr.h"
#ifdef SIMULATOR
#include "lcl_xcvr_simu.h"
#endif


#if !defined(CPU_KW47B42Z83AFTA_cm33_core1) && !defined(CPU_KW47B42ZB7AFTA_cm33_core1) && !defined(CPU_MCXW727CMFTA_cm33_core1) \
    && !defined(CPU_KW43B43ZC7MFPA_NBU) && !defined(CPU_KW43B43ZC7MFTA_NBU)
#error this code is supposed to be compiled on KW47/KW43 core1
#endif

/* === Macros ============================================================== */
#define T_SLOT_US  (625U)

/* The following timings have been measured in debug mode with IAR 9.30.1 */
/* TODO OJE: Exact HAL timings need to be measured on KW47 */
/*! Time needed to execute BLE_HADM_Calibrate()
 * in order to perform the radio calibrations (HPM and DCOC)
 */
#define HADM_HAL_HPM_CAL_US  (180U)
#define HADM_HAL_DCOC_CAL_US (410U)
#define HADM_HAL_RADIO_CAL_US (HADM_HAL_DCOC_CAL_US + HADM_HAL_HPM_CAL_US)

/*! Time needed by the HAL to execute BLE_HADM_EventConfigApply()
 *  Does not need to be exact, should cover longest execution path
 */
#define HADM_HAL_PREPARE_US (50U)

/* In some cases (low power), the SW INT is triggered with up to 9us later than HW trigger */
#define HADM_HAL_RSM_TRIGGER_DELAY_MARGIN (10U)

/*! Time to be programmed to RSM_TRIGGER_DELAY
 *  Does not need to be exact, should cover RSM SW initialization
 *  Optimized version corresponds to CS/CS transition (no restore/save for BLE registers)
 */
#define HADM_HAL_RSM_TRIGGER_DELAY (135U + HADM_HAL_RSM_TRIGGER_DELAY_MARGIN)
#define HADM_HAL_RSM_TRIGGER_DELAY_OPTIM (40U + HADM_HAL_RSM_TRIGGER_DELAY_MARGIN)

/* 2us between cdt_expiry and RSM FSM start */
#define HADM_HAL_RSM_TRIGGER_OFFSET (2U)

/* Contengency time to make sure mode 0 AA is caught */
#define HADM_MODE0_TIMEOUT_MARGIN_US (5U)

/* === Types =============================================================== */

/* === Globals ============================================================= */

//#define RTT_DEBUG
#ifdef RTT_DEBUG
int32_t rtt_tpm_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_frac_dbg_buffer[HADM_MAX_NB_STEPS];
int16_t rtt_p_delta_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_int_adj_dbg_buffer[HADM_MAX_NB_STEPS];
int32_t rtt_common_stat_dbg_buffer[HADM_MAX_NB_STEPS];
#endif

static BLE_HADM_HalProperties_t hadm_hal_properties;

/* This reflects the capabilities of our IC */
/* CS capabilities might be further refined by the controller based on external elements capabilities (e.g antenna system) */
static const BLE_HADM_HalCapabilities_t hadm_hal_capabilities = {
    .stepModeSupported          = 1U, /* step mode 3 is supported */
    .numAntennasSupported       = HADM_MAX_NB_ANTENNAS,
    .nNumAPSupported            = HADM_MAX_NB_ANTENNA_PATHS,
    .RTT_Capability             = 0x5, /* RTT_Coarse_N field refers to the 10ns precision requirement (AA only and random seq) */
    .RTT_Coarse_N               = 10, /* Number of RTT steps to satisfy the precision requirement. */ 
    .RTT_Sounding_N             = 0, /* not supported */
    .RTT_Random_Sequence_N      = 10, /* Number of RTT steps to satisfy the precision requirement. */
    .NADM_Sounding_Capability   = 0, /* NADM not supported */
    .NADM_Random_Sequence_Capability = 1, /* NADM supported */
    .PHYSupported               = 1<<1, /* 2Mbps PHY supported (bit #1) */
    .T_SW_TimeSupported         = 2, /* 2us: OJE TODO confirm OK for ramp-up/down */
    .FAErequired                = 0, /* no FAE */
    .InlinePhaseReturn          = 0U, /* to enable by _LE_HADM_NXP_Config */
    /* note: mandatory timings are not included in capabilities */
    .T_IP1_TimesSupported       = 0x0048, /* T_IP1=80 or 40us */
    .T_IP2_TimesSupported       = 0x0048, /* T_IP2=80 or 40us */
    .T_FCS_TimesSupported       = 0x0050, /* T_FCS=80 or 50us */
    .T_PM_TimesSupported        = 0x0002, /* T_PM=20us */
};

/* Contains data associated to this device */
hadm_device_t hadm_device;
/* Contains data that needs to be maintained across several subevents of the same procedure.
 * Several procedures may run in parallele (multi-connection).
 */
static hadm_proc_t hadm_procs[HADM_MAX_NB_CONNECTIONS];
/* Contains data for current subevent */
static hadm_meas_t hadm_meas[HADM_MAX_NB_SIMULT_SUBEVENTS];

const uint8_t rtt_type_2_payload_size[7U] = {0U, 1U, 3U, 1U, 2U, 3U, 4U}; /* in 32 bits words */

/* === Externals =========================================================== */

/* === Prototypes ========================================================== */

static void lcl_hadm_consume_drbg(hadm_meas_t *hadm_meas_p);
static void lcl_hadm_measurement_shutdown(hadm_meas_t *hadm_meas_p, bool_t abort_subevent);
static void lcl_hadm_measurement_setup(hadm_proc_t *hadm_proc, hadm_meas_t *hadm_meas_p, const BLE_HADM_SubeventConfig_t *hadm_config);
static BLE_HADM_STATUS_t lcl_hadm_get_step_results(uint16 n_steps, hadm_meas_t *hadm_meas_p);
static BLE_HADM_STATUS_t lcl_hadm_set_steps_config(uint16 n_steps, hadm_meas_t *hadm_meas_p, bool_t update_rsm_ptr);
static hadm_meas_t *lcl_hadm_alloc_meas_instance(void);
static void lcl_hadm_free_meas_instance(hadm_meas_t *meas_p);
static hadm_meas_t *lcl_hadm_get_meas_instance(const BLE_HADM_SubeventConfig_t *config_p);
void lcl_hadm_irq_handler(void *userData, bool abort, uint32_t rsm_csr);

/* === Implementation (public) ============================================= */

BLE_HADM_STATUS_t lcl_hadm_init_procedure(uint8 connIdx)
{
    hadm_proc_t *hadm_proc;

    if (connIdx >= HADM_MAX_NB_CONNECTIONS)
    {
        assert(FALSE);
        return HADM_HAL_INVALID_ARGS;
    }
    hadm_proc = &hadm_procs[connIdx];
    hadm_proc->ppm = 0;
    hadm_proc->cfo_channel = 0;
    hadm_proc->cfo = 0;
    hadm_proc->agc_idx = 0xFF;
    hadm_proc->agc_idx2 = 0xFF;
    hadm_proc->is_proc_init_done = true;

    return HADM_HAL_SUCCESS;
}

BLE_HADM_STATUS_t lcl_hadm_init(void)
{
    int i;
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;

    lcl_hadm_utils_init_buffers();
    lcl_hadm_enable_lcl_interrupts();
    
