nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    /* RTT: Compute RTT local contributions */
    lcl_hadm_utils_calc_ts_delay(hadm_meas_p, &hadm_device);

    /* Configure rttAntennaID to be used during first mode 0 */
    /* If no recommendation from the host then apply crossed roud robin in the controller since it gives better perf */
    if (hadm_config->rttAntennaID >= HADM_RTT_ANT_ROUND_ROBIN)
        hadm_meas_p->rtt_antenna_id = 0U; /* start round robin */
    else
        hadm_meas_p->rtt_antenna_id = hadm_config->rttAntennaID - 1U; /* fixed antenna */
    
    /* Clear info structs */
    hadm_meas_p->info.rtt_dbg_buffer_nb = 0;
    hadm_meas_p->info.mciq_dbg_buffer_nb = 0;
    hadm_meas_p->info.sync_cfo = 0;
    hadm_meas_p->info.sync_rxgain = 0xFF;
    hadm_meas_p->info.sync_rssi = -128;
    hadm_meas_p->info.sync_step_id = 0xFF;
    hadm_meas_p->info.flags = 0;
    hadm_meas_p->info.xtal_trim = 0U; /* = (int32_t)XCVR_GetXtalTrim() avoid use XCVR_GetXtalTrim which use RFMC and requires CM33 wakeup */
    hadm_meas_p->info.temperature = hadm_device.current_temperature;
    hadm_meas_p->info.num_time_adj = 0;
    
    hadm_meas_p->pkt_ram.config_write_ptr = hadm_meas_p->pkt_ram.step_config.base_ptr;
    hadm_meas_p->pkt_ram.result_read_ptr = hadm_meas_p->pkt_ram.step_result.base_ptr;
    hadm_meas_p->pkt_ram.step_config.curr_page = 0;
    hadm_meas_p->pkt_ram.step_config.curr_step_idx = 0;
    hadm_meas_p->pkt_ram.step_config.max_step_size = LCL_HAL_PKT_RAM_STEP_CONFIG_MODE13_SIZE(hadm_meas_p->n_ap) + rtt_type_2_payload_size[hadm_meas_p->config_p->rttTypes] * 2U; /* taking mode1/3 into account */
    hadm_meas_p->pkt_ram.step_result.curr_page = 0;
    hadm_meas_p->pkt_ram.step_result.curr_step_idx = 0;
    hadm_meas_p->pkt_ram.step_result.max_step_size = LCL_HAL_PKT_RAM_STEP_RESULT_MODE3_SIZE(hadm_meas_p->n_ap); /* taking mode3 into account */
    if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
    {
        hadm_meas_p->pkt_ram.step_result.max_step_size *= HADM_SNIFFER_DEVICE_NB;
    }
    /* Compute nb_steps_before_irq based on larget circ buffer step size (+ contingency (/2)) */
    hadm_meas_p->pkt_ram.nb_steps_before_irq = (HADM_HAL_PKT_RAM_CONFIG_CIRC_BUFF_SIZE / (MAX(hadm_meas_p->pkt_ram.step_config.max_step_size, hadm_meas_p->pkt_ram.step_result.max_step_size))) / 2U;
    if (hadm_meas_p->pkt_ram.nb_steps_before_irq > HADM_HAL_PKT_RAM_MAX_NB_STEPS_BEFORE_IRQ)
    {
        hadm_meas_p->pkt_ram.nb_steps_before_irq = HADM_HAL_PKT_RAM_MAX_NB_STEPS_BEFORE_IRQ;
    }
    hadm_meas_p->pkt_ram.nb_irq_steps_handled = 0;
    hadm_meas_p->pkt_ram.nb_irq_steps_postponed = 0;
    for (i=0; i < HADM_MAX_NB_STEPS_MODE0; i++)
    {
        hadm_meas_p->sync_info[i].valid = 0;
    }
    hadm_meas_p->data_in_flight_w_idx = 0;
    hadm_meas_p->data_in_flight_r_idx = 0;


    /* Prepare RSM configuration in RAM */
    DEBUG_PIN1_SET

    rsm_config_p->num_steps = hadm_meas_p->config_p->stepsNb;
    rsm_config_p->num_ant_path = hadm_meas_p->n_ap;
    rsm_config_p->rate = (XCVR_RSM_SQTE_RATE_T)hadm_meas_p->config_p->rttPhy;
    rsm_config_p->rsm_dma_dly_fm_ext = (HADM_T_FM - hadm_meas_p->iq_capture_win) >> 1; /* center capture window inside T_FM */
    rsm_config_p->rsm_dma_dur_fm_ext = hadm_meas_p->iq_capture_win;
    rsm_config_p->averaging_win = (hadm_meas_p->iq_avg_win == 0) ? XCVR_RSM_AVG_WIN_DISABLED : (XCVR_RSM_AVG_WIN_LEN_T) (hadm_meas_p->iq_avg_win - 1);
    /* RSM trig_delay must cover start API execution time */
    rsm_config_p->trig_delay = ((HADM_IS_RSM_OPTIM_INACTIVE(hadm_meas_p->config_p)) || (hadm_meas_p->config_p->subeventIdx == 0)) ? HADM_HAL_RSM_TRIGGER_DELAY:HADM_HAL_RSM_TRIGGER_DELAY_OPTIM;
    rsm_config_p->t_fc = hadm_config->T_FCS_Time;
    rsm_config_p->t_ip1 = hadm_config->T_IP1_Time;
    rsm_config_p->t_ip2 = hadm_config->T_IP2_Time;
    rsm_config_p->t_sw = (lclTSw_t)hadm_config->T_SW_Time;
    rsm_config_p->rtt_type = (XCVR_RSM_RTT_TYPE_T)hadm_meas_p->config_p->rttTypes;
    rsm_config_p->role = (hadm_config->role == HADM_ROLE_INITIATOR) ? XCVR_RSM_TX_MODE : XCVR_RSM_RX_MODE;
    rsm_config_p->sniffer_mode_en = (hadm_config->role == HADM_ROLE_SNIFFER);
    rsm_config_p->enable_inpr = (bool)hadm_config->inlinePhaseReturn;
    rsm_config_p->hpm_cal_manual_val = hadm_device.cal_ch40[hadm_meas_p->config_p->rttPhy].hpm_cal_val;
    rsm_config_p->use_rccal_manual_override = hadm_device.rccal_manual_override_needed;
    rsm_config_p->manual_rccal_value = hadm_device.rtt_static_comp.rttRCcal;

    if (hadm_meas_p->config_p->mode != HADM_SUBEVT_TEST_MODE_PHASE_STAB)
    {
        rsm_config_p->op_mode = XCVR_RSM_SQTE_MODE;
        rsm_config_p->t_pm0 = ((hadm_meas_p->n_ap + 1U) * ((uint32_t)hadm_meas_p->config_p->T_PM_Time + (uint32_t)hadm_meas_p->config_p->T_SW_Time));
    }
    else
    {
        rsm_config_p->op_mode = XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE;
        rsm_config_p->t_pm0 = LCL_HAL_T_PM_MEAS; /* Set to T_PM_MEAS for stable phase test */
        hadm_meas_p->iq_buff_size_mode0 = 0;
        hadm_meas_p->iq_buff_size = 0;
        hadm_meas_p->iq_avg_win = 0;
    }
    
    /* Determine and program rx timeout (for reflector devices) = mode 0 duration in order to keep RX channel in sync with initiator */
    /* From HW spec: RSM timeout interval = mode0_timeout + T_FCS + T_RD + TX_DATA_FLUSH_DLY + 1 */
    mode0_timeout_usec = hadm_meas_p->step_duration[0] - (hadm_config->T_FCS_Time + T_RD + ((hadm_config->rttPhy == HADM_RTT_PHY_2MBPS) ? TX_DATA_FLUSH_DLY_2MBPS:TX_DATA_FLUSH_DLY_1MBPS) + 1);
    assert(mode0_timeout_usec > HADM_T_SY(hadm_config->rttPhy) + HADM_MODE0_TIMEOUT_MARGIN_US);
    /* If window widening is larger than the mode0 RX window minus packet duration, do not activate rx timeout */
    if ((hadm_meas_p->config_p->mode == HADM_SUBEVT_MISSION_MODE) &&
        (hadm_config->rxWindowUs < (mode0_timeout_usec - HADM_T_SY(hadm_config->rttPhy) - HADM_MODE0_TIMEOUT_MARGIN_US)))
    {
        /* Program the mode0 timeout (the actual duration of RX period) */
        rsm_config_p->mode0_timeout_usec = (uint16_t)mode0_timeout_usec;
    }
    else
    {
        rsm_config_p->mode0_timeout_usec = 0; /* means no timeout */
    }
    
    status = XCVR_LCL_ValidateRsmSettings(rsm_config_p);
    if (gXcvrLclStatusSuccess != status)
        goto config_error;

